package task;

public class Task01 {
//	1. 숫자를 입력받아 1부터 입력받은 숫자까지의 합을 출력하는 프로그램을 만드세요. 
//	그리고 숫자가 아닌 값이 입력될 경우 "잘못된 입력입니다"라는 예외 메시지를 출력하고, 
//	프로그램을 종료하세요.
//
	
	
	
	
	
	
	
//	2. 문자열을 입력받아, 입력받은 문자열을 정수로 변환하여 출력하는 프로그램을 작성하세요. 
//	만약 입력받은 문자열이 숫자가 아닐 경우, NumberFormatException 예외가 발생하게 되며, 
//	"숫자가 아닌 문자열이 입력되었습니다"라는 메시지를 출력하세요.
//
//	3. 사용자로부터 정수를 입력받아, 입력받은 정수가 0에서 100 사이의 값인 경우, 
//	입력받은 정수를 2배한 값을 출력하고, 그 외의 값이 입력될 경우 
//	"잘못된 입력입니다"라는 예외 메시지를 출력하세요.
//
//	4. 사용자로부터 숫자를 입력받아, 입력받은 숫자가 3의 배수인 경우 "Fizz", 
//	5의 배수인 경우 "Buzz", 3과 5의 공배수인 경우 "FizzBuzz", 
//	그 외의 경우에는 입력받은 숫자를 출력하는 프로그램을 작성하세요. 
//	사용자가 문자열을 입력할 경우, "숫자가 아닌 문자열이 입력되었습니다"라는 예외 메시지를 출력하세요.
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
